from statspylib.HypothesisTesting.NonparametricHypothesisTesting import *

import pandas as pd

'''
???例7.1.1 在某保险种类中, 一次关于2006年的索赔数额(单位:元)的随机抽样为(按升幂排列):
4632, 4728, 5052, 5064, 5484, 6972, 7696, 9048,
14760, 15013, 18730,21240, 22836, 52788, 67200.
已知2005年的索赔数额的中位数为6064元. 问2006年索赔的中位数与前一年是
否有所变化？p=0.05
'''
a=Single_Population_Test()
a.median_sign_test([4632,4728,5052,5064,5484,6972,7696,9048,14760,15013,18730,21240,22836,52788,67200],6064)

#???同上
b=Single_Population_Test()
b.wilcoxon_signed_rank_test([4632,4728,5052,5064,5484,6972,7696,9048,14760,15013,18730,21240,22836,52788,67200])

'''
例7.2.1 某箱子中盛有10种球，现在从中有返回地随机抽取200个, 其
中第i种球共取得ºi个, 数据记录在表7.1. 问箱子中这10种球的比例是否一样?p=0.05
'''
goodness_of_fit_test([35,16,15,17,17,19,11,16,30,24],[sum([35,16,15,17,17,19,11,16,30,24])/len([35,16,15,17,17,19,11,16,30,24])]*10,0.05)


#p220 例 9.2
c=Double_Population_Test()    
c.test_of_independence(pd.DataFrame({'one':[52,60,50],'two':[64,59,65],'three':[24,52,74]},index=['jia','yi','bing'],columns=['one','two','three']))

'''
例7.3.1 表是对63个肺癌患者和由43人组成的对照组的调查结果.
问总体中患肺癌是否与吸烟有关系?p=0.05
			吸烟	不吸烟
肺癌患者	60 	3
对照组	32 	11
'''
d=Double_Population_Test()
d.fisher_exact_test(pd.DataFrame({'xi':[60,32],'buxi':[3,11]},index=['fei','dui'],columns=['xi','buxi']),alternative="greater")

'''
例7.3.3 有糖尿病的和正常的老鼠重量为（单位：克）
糖尿病鼠：42, 44, 38, 52, 48, 46, 34, 44, 38;
正常老鼠：34, 43, 35, 33, 34, 26, 30, 31, 31, 27, 28, 27, 30, 37, 32.
检验这两组的体重是否有显著不同?p=0.05
'''
e=Double_Population_Test()
e.wilcoxon_rank_sum_test([42,44,38,52,48,46,34,44,38],[34,43,35,33,34,26,30,31,31,27,28,27,30,37,32])
e.mann_whitney_U_test([42,44,38,52,48,46,34,44,38],[34,43,35,33,34,26,30,31,31,27,28,27,30,37,32])

'''
例7.3.4 两个村农民的月收入分别为(单位: 元)
A村：321, 266, 256, 388, 330, 329, 303, 334, 299, 221, 365, 250, 258, 342,
343, 298, 238, 317, 354;
B村：488, 598, 507, 428, 807, 342, 512, 350, 672, 589, 665, 549, 451, 481,
514, 391, 366, 468.
问两个村农民的月收入的内部差异是否相同?p=0.05
'''
f=Double_Population_Test()
A=pd.Series([321, 266, 256, 388, 330, 329, 303, 334, 299, 221, 365, 250, 258, 342,343, 298, 238, 317, 354])
B=pd.Series([488, 598, 507, 428, 807, 342, 512, 350, 672, 589, 665, 549, 451, 481, 514, 391, 366, 468])
f.mood_test(A+(B.median()-A.median()),B)

'''
例7.4.2 两个工人加工的零件尺寸(各10个)为(单位:mm):
工人A: 18.0, 17.1, 16.4, 16.9, 16.9, 16.7, 16.7, 17.2, 17.5, 16.9;
工人B: 17.0, 16.9, 17.0, 16.9, 17.2, 17.1, 16.8, 17.1, 17.1, 17.2.
这个结果能否说明两个工人的水平(加工精度)一致?p=0.05
'''
g=Double_Population_Test()
g.ansari_bradle_test([18.0,17.1,16.4,16.9,16.9,16.7,16.7,17.2,17.5,16.9],[17.0,16.9,17.0,16.9,17.2,17.1,16.8,17.1,17.1,17.2])

'''
例7.4.1 下面的数据是游泳、打篮球、骑自行车等三种不同的运动
在30分钟内消耗的热量(单位:卡路里). 这些数据是否说明这三种运动消耗的
热量全相等?p=0.05
游泳: 306, 385, 300, 319, 320;
打篮球: 311, 364, 315, 338, 398;
骑自行车: 289, 198, 201, 302, 289.
'''
h=Multiple_Population_Test()
h.kruskal_wallis_rank_sum_test([306, 385, 300, 319, 320],[311, 364, 315, 338, 398],[289, 198, 201, 302, 289])

'''
例7.4.3 三名不同的运动员A、B、C同时在同一条件下进行打靶比
赛,各打10发子弹,他们打中的环数如下:
A: 8, 7, 9, 10, 9, 6, 5, 8, 10, 5;
B: 8, 7, 9, 6, 8, 9, 10, 7, 8, 9;
C: 10, 10, 9, 6, 8, 3, 5, 6, 7, 4.
问这三名运动员的稳定性是否一样?p=0.05
'''
i=Multiple_Population_Test()
i.fligner_killeen_test([8,7,9,10,9,6,5,8,10,5],[8,7,9,6,8,9,10,7,8,9],[10,10,9,6,8,3,5,6,7,4])